In [174]:
import pandas as pd

In [175]:
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개'])
menu

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

In [176]:
price = pd.Series([10000, 9000, 8000])
price

0    10000
1     9000
2     8000
dtype: int64

In [177]:
df = pd.DataFrame({'메뉴':menu, '가격':price})
df

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [178]:
df.메뉴

0     비빔밥
1    김치찌개
2    된장찌개
Name: 메뉴, dtype: object

In [179]:
df[['메뉴']]

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [180]:
df.메뉴.to_frame()

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [181]:
df[['가격','메뉴']]

      가격    메뉴
0  10000   비빔밥
1   9000  김치찌개
2   8000  된장찌개

In [182]:
cols = ['가격', '메뉴']
df[cols]

      가격    메뉴
0  10000   비빔밥
1   9000  김치찌개
2   8000  된장찌개

In [183]:
type(df['가격']), type(df[['메뉴']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [184]:
df = pd.DataFrame({
    "메뉴":['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500, 5000, 5500, 5000, 4000, 5900, 5300],
    "칼로리":[10, 110, 250, 110, 20, 210, 0],
})
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [185]:
df.to_csv('test.csv')

In [186]:
temp_df = pd.read_csv('test.csv', index_col=None, usecols=['메뉴', '가격'], encoding='utf-8')
temp_df

      메뉴    가격
0  아메리카노  4500
1   카페라떼  5000
2   카페모카  5500
3   카푸치노  5000
4  에스프레소  4000
5    밀크티  5900
6     녹차  5300

In [187]:
df.sample(3)

      메뉴    가격  칼로리
3   카푸치노  5000  110
6     녹차  5300    0
0  아메리카노  4500   10

In [188]:
df.sample()

     메뉴    가격  칼로리
1  카페라떼  5000  110

In [189]:
df.shape

(7, 3)

In [190]:
# 컬럼별 데이터 타입
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [191]:
# 컬럼별 상관관계
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [192]:
# 중복 값이 있는 데이터 생성
df_car = pd.DataFrame({
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S', 'M','S']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [193]:
# 고유한 값
print(df_car.nunique())
df_car['size'].nunique(), df_car['car'].nunique()

car     2
size    3
dtype: int64

(3, 2)

In [194]:
df_car['car'].unique(), df_car['size'].unique()

(array(['Sedan', 'SUV'], dtype=object), array(['S', 'M', 'L'], dtype=object))

In [195]:
df_car['car'].value_counts()

car
Sedan    7
SUV      4
Name: count, dtype: int64

In [196]:
display(df.head())
df.describe()

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [197]:
display(df_car.head())
df_car.describe(include='O')

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S
3    SUV    S
4    SUV    M

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [198]:
# 데이터 준비
data = {
    "메뉴":['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500.0, 5000.0, 5500.0, 5000.0, 4000.0, 5900.0, 5300.0],
    "칼로리":['10', '110', '250', '110', '20', '210', '0'],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      object
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [199]:
df['가격'] = df['가격'].astype("int64")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [200]:
df['칼로리'] = df['칼로리'].astype("int64")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [201]:
df.to_csv('cafe.csv')

In [202]:
df = pd.read_csv('cafe.csv', index_col=0)
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [203]:
df['new'] = 0
df

      메뉴    가격  칼로리  new
0  아메리카노  4500   10    0
1   카페라떼  5000  110    0
2   카페모카  5500  250    0
3   카푸치노  5000  110    0
4  에스프레소  4000   20    0
5    밀크티  5900  210    0
6     녹차  5300    0    0

In [204]:
discount = 0.2
df['할인가'] = df['가격']*(1-discount)
df

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
1   카페라떼  5000  110    0  4000.0
2   카페모카  5500  250    0  4400.0
3   카푸치노  5000  110    0  4000.0
4  에스프레소  4000   20    0  3200.0
5    밀크티  5900  210    0  4720.0
6     녹차  5300    0    0  4240.0

In [205]:
# 행 = 0
# 열 = 1

df.drop(1, axis=0)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
2   카페모카  5500  250    0  4400.0
3   카푸치노  5000  110    0  4000.0
4  에스프레소  4000   20    0  3200.0
5    밀크티  5900  210    0  4720.0
6     녹차  5300    0    0  4240.0

In [206]:
df.drop('메뉴', axis=1)

     가격  칼로리  new     할인가
0  4500   10    0  3600.0
1  5000  110    0  4000.0
2  5500  250    0  4400.0
3  5000  110    0  4000.0
4  4000   20    0  3200.0
5  5900  210    0  4720.0
6  5300    0    0  4240.0

In [207]:
df = pd.read_csv('cafe.csv', index_col=0)
df.head(3)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250

In [208]:
df.loc[0]

메뉴     아메리카노
가격      4500
칼로리       10
Name: 0, dtype: object

In [209]:
df.loc[1, '가격']

5000

In [210]:
df.loc[:, '칼로리']

0     10
1    110
2    250
3    110
4     20
5    210
6      0
Name: 칼로리, dtype: int64

In [211]:
df.loc[1, '가격':'칼로리']

가격     5000
칼로리     110
Name: 1, dtype: object

In [212]:
df.loc[1, ['메뉴','칼로리']]

메뉴     카페라떼
칼로리     110
Name: 1, dtype: object

In [213]:
df.loc[1:3, ['메뉴','칼로리']]

     메뉴  칼로리
1  카페라떼  110
2  카페모카  250
3  카푸치노  110

In [214]:
df.drop(0, axis=0, inplace=True)
df.iloc[0]
# df.loc[0]

메뉴     카페라떼
가격     5000
칼로리     110
Name: 1, dtype: object

In [217]:
df

      메뉴    가격  칼로리
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [220]:
df.iloc[:,1]

1    5000
2    5500
3    5000
4    4000
5    5900
6    5300
Name: 가격, dtype: int64

In [222]:
df = pd.read_csv('cafe.csv', index_col=0)
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [228]:
import numpy as np

df['원산지'] = np.nan
df

      메뉴    가격  칼로리  원산지
0  아메리카노  4500   10  NaN
1   카페라떼  5000  110  NaN
2   카페모카  5500  250  NaN
3   카푸치노  5000  110  NaN
4  에스프레소  4000   20  NaN
5    밀크티  5900  210  NaN
6     녹차  5300    0  NaN

In [230]:
df.loc[0, '원산지'] = '콜롬비아'
df.iloc[2:4, 3] = '과테말라'
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20   NaN
5    밀크티  5900  210   NaN
6     녹차  5300    0   NaN

In [234]:
df.loc['시즌'] = ['크리스마스라떼', 6000, 300, '한국']
df.tail(3)

         메뉴    가격  칼로리  원산지
5       밀크티  5900  210  NaN
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국

In [239]:
df.loc[7] = {'메뉴': '새로운 커피', '가격':2000, '칼로리':20}
df.tail(3)

         메뉴    가격  칼로리  원산지
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국
7    새로운 커피  2000   20  NaN

In [240]:
df.drop('시즌', axis=0, inplace=True)
df.to_csv('cafe2.csv', index=False)

In [241]:
df = pd.read_csv('cafe2.csv')
df

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [245]:
df.sort_index(ascending=False)

       메뉴    가격  칼로리   원산지
7  새로운 커피  2000   20   NaN
6      녹차  5300    0   NaN
5     밀크티  5900  210   NaN
4   에스프레소  4000   20   NaN
3    카푸치노  5000  110  과테말라
2    카페모카  5500  250  과테말라
1    카페라떼  5000  110   NaN
0   아메리카노  4500   10  콜롬비아

In [247]:
df.sort_values(by='가격', ascending=False)

       메뉴    가격  칼로리   원산지
5     밀크티  5900  210   NaN
2    카페모카  5500  250  과테말라
6      녹차  5300    0   NaN
1    카페라떼  5000  110   NaN
3    카푸치노  5000  110  과테말라
0   아메리카노  4500   10  콜롬비아
4   에스프레소  4000   20   NaN
7  새로운 커피  2000   20   NaN

In [250]:
df.sort_values(by=['가격', '메뉴'], ascending=[False, True], inplace=True)
df

       메뉴    가격  칼로리   원산지
5     밀크티  5900  210   NaN
2    카페모카  5500  250  과테말라
6      녹차  5300    0   NaN
1    카페라떼  5000  110   NaN
3    카푸치노  5000  110  과테말라
0   아메리카노  4500   10  콜롬비아
4   에스프레소  4000   20   NaN
7  새로운 커피  2000   20   NaN

In [252]:
df.reset_index(drop=True, inplace=True)
df

       메뉴    가격  칼로리   원산지
0     밀크티  5900  210   NaN
1    카페모카  5500  250  과테말라
2      녹차  5300    0   NaN
3    카페라떼  5000  110   NaN
4    카푸치노  5000  110  과테말라
5   아메리카노  4500   10  콜롬비아
6   에스프레소  4000   20   NaN
7  새로운 커피  2000   20   NaN

In [253]:
df = pd.read_csv('cafe2.csv')
df

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [255]:
df[df.칼로리 < 50]

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
4   에스프레소  4000   20   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [258]:
df[~df.칼로리 < 50]
df[~(df.메뉴 == '아메리카노')]

       메뉴    가격  칼로리   원산지
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [259]:
df[(df['가격']>=5000)&(df['칼로리']>100)]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN

In [261]:
cond1 = df['가격'] >= 5000
cond2 = df['칼로리'] > 100
df[cond1 | cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN
6    녹차  5300    0   NaN

In [262]:
df[df['원산지'] == '과테말라']

     메뉴    가격  칼로리   원산지
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라

In [263]:
df[(df['원산지']=='과테말라')&(df['가격']<=5000)]

     메뉴    가격  칼로리   원산지
3  카푸치노  5000  110  과테말라

In [268]:
df[df['메뉴'].isin(['녹차'])]

   메뉴    가격  칼로리  원산지
6  녹차  5300    0  NaN

In [269]:
df['가격'].isin([5000, 5500])

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7    False
Name: 가격, dtype: bool

In [272]:
df[df['메뉴'].isin(['녹차', '카페라떼', '카푸치노'])]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
3  카푸치노  5000  110  과테말라
6    녹차  5300    0   NaN

In [273]:
df = pd.read_csv('cafe2.csv')
df

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [274]:
df.isnull()

      메뉴     가격    칼로리    원산지
0  False  False  False  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False   True
6  False  False  False   True
7  False  False  False   True

In [277]:
df.isnull().sum()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64

In [278]:
df.isna()

      메뉴     가격    칼로리    원산지
0  False  False  False  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False   True
6  False  False  False   True
7  False  False  False   True

In [279]:
df.isna().sum()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64